In [1]:
import requests
import bs4
import json
import pandas as pd

In [2]:
url = "https://api.apilayer.com/exchangerates_data/latest?base=EUR&apikey=WDTmV8OJMrWHOWNYcpKMBWI1Gw5wXmoG"

In [3]:
data = json.loads(requests.get(url).text)

In [4]:
data['rates']['INR']

83.506529

In [5]:
currency = data['rates'].keys()

In [6]:
rate = data['rates'].values()

In [7]:
df = pd.DataFrame(zip(currency, rate),columns = ['Currency', 'Rate'])

In [5]:
df = pd.DataFrame(columns = [['Currency', 'Rate']])

In [10]:
df = pd.DataFrame(index = data['rates'].keys(), data = data['rates'].values(), columns = ['Rate'])

In [11]:
df

            Rate
AED     3.789575
AFN    90.979858
ALL   116.985840
AMD   407.105247
ANG     1.853171
..           ...
YER   258.185898
ZAR    17.845994
ZMK  9286.620771
ZMW    16.852336
ZWL   332.210068

[169 rows x 1 columns]

In [8]:
df1 = df.set_index('Currency')

In [9]:
df1.head()

                Rate
Currency
AED         3.810075
AFN        91.053524
ALL       117.084532
AMD       407.515772
ANG         1.854672

In [10]:
df1.count()

Rate    169
dtype: int64

In [11]:
df1.to_csv('exchange_rates_1.csv', index = True, header=True)